class DF:

    description = """
    Предусловие:
    """

    admin = """
    - Создать пользователя с правами администратора"""

    created_accounts = """
    - Создать абонентов"""

    created_conferences = """
    - Создать конференции
    - Задать нужные настройки конференции
    - Запустить конференцию"""

    fill_address_book = """
    - Создать контакты в адресной книге
    - Создать профили в адресной книге
    - Создать группы в аресной книге"""

    api_key = """
    - Создать ключ-API"""

    gateway = """
    - Создать шлюз"""

    sub = """
    - Создать подписчика webhooks"""

    created_gateway_h323 = """
    - Создать шлюз h323"""

    created_gateway = """
    - Создать шлюз SIP"""

    tenant = """
    - Создать тенант"""

    user = """
    - Создать пользователя без прав администратора"""

    record_audio = """
    - Создать аудио запись конференции"""

    record = """
    - Создать запись конференции"""

    tenant_two_user = """
     - Создать два мультитенанта
     - Создать два пользователя с правами администратора
     - Назначить мультитенанты на пользователей"""

    provider = """
    - Создать провайдер"""
    
    admin_two = """
    - Создать два пользователя с правами администратора
    """
